Repository: dotnet/AspNetCore.Docs
Catalog: aspnetcore/fundamentals/localization/Localization.StarterWeb/src/Localization.StarterWeb/Resources/Views/Info/Index.*.resx
Languages: fa_ir

source: &lt;a href=&quot;http://go.microsoft.com/fwlink/?LinkId=518007&quot;&gt;Gulp&lt;/a&gt; and &lt;a href=&quot;http://go.microsoft.com/fwlink/?LinkId=518004&quot;&gt;Bower&lt;/a&gt; for managing client-side libraries
fa_ir: <a href="http://go.microsoft.com/fwlink/?LinkId=518007">Gulp</a> و <a href="http://go.microsoft.com/fwlink/?LinkId=518004">Bower</a> بررسی کتابخانه های سمت کلاینت

source: Add a Controller and View
fa_ir: <h1> ایجاد کنترلر جدید (Add a Controller and View) Resources\Views\Home\Index.fa-IR.resx </h1>

source: Add an appsetting in config and access it in app.
fa_ir: افزودن و پیکر بندی تنظیمات به برنامه

source: Add client packages using Bower.
fa_ir: افزودن بسته سمت کلاینت بوور

source: Add packages using NuGet.
fa_ir: افزودن بسته ناگت

source: Application uses
fa_ir: کاربرد برنامه

source: Bring in libraries from NuGet, Bower, and npm, and automate tasks using Grunt or Gulp.
fa_ir: استفاده از کتابخانه و توابع مفید ناگت - بوور - گالپ و گرانت

source: Client side development
fa_ir: توسعه برنامه نویسی سمت کلاینت

source: Conceptual overview of what is ASP.NET 5
fa_ir: توضیحات تکمیلی در خصوص فریم ورک ای اس پی دات نت 5

source: Develop on different platforms
fa_ir: قابلیت توسعه با پلت فرم های متفاوت

source: Fundamentals of ASP.NET 5 such as Startup and middleware.
fa_ir: اصول فریم ورک جدید

source: Home Page
fa_ir: صفحه نخست

source: How to
fa_ir: چگونه

source: Learn how Microsoft's Azure cloud platform allows you to build, deploy, and scale web apps.
fa_ir: یادگیری سرویس آزیور شرکت مایکروسافت

source: Learn how to build ASP.NET apps that can run anywhere.
fa_ir: چگونه یک برنامه جدید بسازید!

source: Learn More
fa_ir: بیشتر بدانید

source: Manage User Secrets using Secret Manager.
fa_ir: مدیریت رازداری و حریم خصوصی کاربران

source: Next
fa_ir: بعدی

source: Overview
fa_ir: بررسی اجمالی

source: Package Management
fa_ir: مدیریت بسته ها

source: Previous
fa_ir: قبلی

source: Publish to Microsoft Azure Web Apps
fa_ir: پابلیش روی سرویس آزیور

source: Read more on the documentation site
fa_ir: اطلاعات بیشتر داکیومنتیشن

source: Run &amp; Deploy
fa_ir: اجرا و توسعه

source: Run commands in your project.json
fa_ir: اجرای دستورات در فایل پراجکت دات جیسون

source: Run your app
fa_ir: اجرای برنامه شما

source: Run your app on .NET Core
fa_ir: اجرای برنامه توسط ای اس دات نت کور

source: Sample pages using ASP.NET MVC 6
fa_ir: نمونه صفحه ای اس پی دات نت ام وی سی 6

source: Security
fa_ir: امنیت

source: Target development, staging or production environment.
fa_ir: محیط های توسعه :پروتکشن-استیجینگ-دولوپمنت

source: Theming using
fa_ir: استفاده از قالب <a href="http://go.microsoft.com/fwlink/?LinkID=398939">Bootstrap</a>

source: There are powerful new features in Visual Studio for building modern web apps.
fa_ir: امکانات فوق العاده ویژوال استدیو در خصوص مدرن وب اپلیکیشن

source: Use logging to log a message.
fa_ir: استفاده از لاگینگ جهت لاگ نمودن پیام

source: Working with Data
fa_ir: کار با داده ها
